'''学生信息操作菜单类

用于显示可以对学生信息进行的操作
'''

def print_info():
    '''显示菜单'''
    print('+------------------------------+')
    print('| 1）添加学生信息              |')
    print('| 2）查看所有学生信息          |')
    print('| 3）修改学生的成绩            |')
    print('| 4）删除学生信息              |')
    print('| 5）按学生年龄大小排序        |')
    print('| 6）按学生成绩高低排序        |')
    print('| 7）将信息保存到文件si.txt    |')
    print('| 8）从文件si.txt读取信息      |')
    print('| q）退出                      |')
    print('+------------------------------+')